In [11]:
# Task 1.
# Import libraries
import pandas as pd
import numpy as np

# Import data

students = pd.read_csv('students.csv')
students.head()
students.notnull().sum()

gender                1000
parental_education    1000
test_prep_course      1000
math_score            1000
reading_score         1000
writing_score         1000
dtype: int64

In [12]:
# More female or male
print(students.gender.value_counts())

female    518
male      482
Name: gender, dtype: int64

In [24]:
# Average score
students.mean()

C:\Users\Imran Sarkar Sabbir\AppData\Local\Temp\ipykernel_2992\3161043836.py:2: FutureWarning: Dropping of nuisance columns in DataFrame reductions (with 'numeric_only=None') is deprecated; in a future version this will raise TypeError.  Select only valid columns before calling the reduction.
  students.mean()

math_score       66.089
reading_score    69.169
writing_score    68.054
dtype: float64

In [25]:
# Perfect student
students[(students.math_score == 100) & (students.reading_score == 100) & (students.writing_score == 100)]

,gender,parental_education,test_prep_course,math_score,reading_score,writing_score
458,female,bachelor's degree,none,100,100,100
916,male,bachelor's degree,completed,100,100,100
962,female,associate's degree,none,100,100,100

In [26]:
# Average score with and without prep_course
average_prep = students[students.test_prep_course == 'completed'].math_score.mean()
print('Average score of students with test preparation course:', average_prep)

average_no_prep = students[students.test_prep_course == 'none'].math_score.mean()
print('Average score of students without test preparation course:', average_no_prep)

Average score of students with test preparation course: 69.69553072625699
Average score of students without test preparation course: 64.0778816199377

In [27]:
# Task 2.
# Load the data
salary = pd.read_csv('salary.csv')
salary.head()

   experience_years   age  salary
0               1.1   NaN   39343
1               1.3  24.0   46205
2               1.5  28.7   37731
3               NaN  31.0   43525
4               2.2   NaN   39891

In [28]:
# Filling missing values
salary.fillna({'experience_years': 3}, inplace = True)
salary.age.fillna(salary.age.mean(), inplace = True)
salary.describe()

       experience_years        age         salary
count         30.000000  30.000000      30.000000
mean           4.890000  31.216000   76003.000000
std            2.724265   3.377683   27414.429785
min            1.100000  24.000000   37731.000000
25%            3.000000  29.225000   56720.750000
50%            4.000000  31.216000   65237.000000
75%            6.600000  33.800000  100544.750000
max           10.500000  38.000000  122391.000000

In [ ]:
# Checking correlation
# Correlation between salary and experience is much higher than between salary and age
# so experince seem to be more related to salary
salary.corr()

In [29]:
# Average age of high salary employees

salary_bins = [0, 55000, 90000, 125000]

salary_names = ['Low', 'Medium', 'High']

salary['salary_cat'] = pd.cut(salary.salary, salary_bins, labels = salary_names)

print(salary.salary_cat.value_counts())

salary[salary.salary_cat == 'High'].age.mean()

Medium    13
High      11
Low        6
Name: salary_cat, dtype: int64

33.37418181818182

In [31]:
# Task 3. 
# Load data
movies = pd.read_csv('movies.csv',sep = ',',index_col = 0)
movies.head()

,title,overview,original_language,vote_count,vote_average
0,Ad Astra,"The near future, a time when both hope and har...",en,2853,5.9
1,Bloodshot,"After he and his wife are murdered, marine Ray...",en,1349,7.2
2,Bad Boys for Life,Marcus and Mike are forced to confront new thr...,en,2530,7.1
3,Ant-Man,Armed with the astonishing ability to shrink i...,en,13611,7.1
4,Percy Jackson: Sea of Monsters,"In their quest to confront the ultimate evil, ...",en,3542,5.9

In [32]:
# Remove movies with less than 100 votes

movies = movies[movies.vote_count >= 100]
movies.shape

(8405, 5)

In [33]:
# 3rd most frequent original language
# Japan is in the third position
movies.original_language.value_counts()[:5]

en    7197
fr     328
ja     190
it     132
es     109
Name: original_language, dtype: int64

In [34]:
# Finnish movies
# Two movies, highest rated is The man without the past

movies[movies.original_language == 'fi']

,title,overview,original_language,vote_count,vote_average
6553,The Man Without a Past,"The second part of Aki Kaurismäki's ""Finland"" ...",fi,143,7.4
7142,Rare Exports: A Christmas Tale,It's the eve of Christmas in northern Finland ...,fi,269,6.4

In [35]:
# Average for french and spanish movies
# Average for French movies is slightly higher

print(movies[movies.original_language == 'fr'].vote_average.mean())
print(movies[movies.original_language == 'es'].vote_average.mean())

6.844207317073169
6.823853211009175

In [36]:
# Most frequent vote category
# Average vote between 5 and 7.5 is the most frequent

vote_bins = [-0.01, 2.5, 5, 7.5, 10]

movies['vote'] = pd.cut(movies.vote_average, vote_bins)

movies.vote.value_counts()

(5.0, 7.5]      7008
(7.5, 10.0]      974
(2.5, 5.0]       421
(-0.01, 2.5]       2
Name: vote, dtype: int64